app/controllers/contact_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
	def index
		@user = User.find_by_id(session[:user_id])

SELECT * FROM `contacts` WHERE (user_id = 1 and name = 'europe') LIMIT 1
INSERT INTO `contacts` (`name`, `updated_at`, `user_id`, `created_at`) VALUES('europe', '2010-08-30 06:31:20', 1, '2010-08-30 06:31:20')
---
	def createContact
		if request.post?
			contact = Contact.find(:first, :conditions => ['user_id = ? and name = ?', session[:user_id], params[:contact]])
			if contact == nil
				contact_hash = Hash.new
				contact_hash['user_id'] = session[:user_id]
				contact_hash['name'] = params[:contact]
				contact = Contact.create(contact_hash)

SELECT * FROM `contacts` WHERE (`contacts`.`id` = '1') LIMIT 1
SELECT * FROM `listings` WHERE (`listings`.`id` = '6') LIMIT 1
---
	def addListing
		if request.post? and params[:listing_list] != "-1"
			contact = Contact.find_by_id(params[:id])
			listing = Listing.find_by_id(params[:listing_list])