app/controllers/group_controller.rb

SELECT * FROM `groups` WHERE (`groups`.`id` IS NULL) LIMIT 1
SELECT `listings`.* FROM `listings` INNER JOIN `listings_groups` ON `listings`.id = `listings_groups`.listing_id WHERE ((`listings_groups`.group_id = 1))
---
	def index
		# for redirection after login/logout
		session[:controller] = "listing"
		session[:action] = "index"
		session[:id] = params[:id]

		@group = Group.find_by_id(params[:id])
		@listings = @group.listings


		@options = "<option value='-1' checked>Choose a listing</option>"
		for listing in Listing.find(:all) do
			if !@listings.include?(listing)

SELECT * FROM `groups` WHERE (`groups`.`id` = '1') LIMIT 1
SELECT * FROM `listings` WHERE (`listings`.`id` = '5') LIMIT 1
SELECT `listings`.* FROM `listings` INNER JOIN `listings_groups` ON `listings`.id = `listings_groups`.listing_id WHERE ((`listings_groups`.group_id = 1))
---
	def addListing
		if request.post?
			@group = Group.find_by_id(params[:id])
			listing = Listing.find_by_id(params[:listing_list])
			@group.listings << listing
			@group.save
			@listings = @group.listings

			@options = "<option value='-1' checked>Choose a listing</option>"
			for listing in Listing.find(:all) do
				if !@listings.include?(listing)