app/controllers/listing_controller.rb

SELECT * FROM `listings` WHERE (`listings`.`id` IS NULL) LIMIT 1
SELECT * FROM `cities` WHERE (`cities`.`id` = 1) LIMIT 1
SELECT `groups`.* FROM `groups` INNER JOIN `listings_groups` ON `groups`.id = `listings_groups`.group_id WHERE ((`listings_groups`.listing_id = 5))
SELECT `listings`.id FROM `listings` INNER JOIN `listings_groups` ON `listings`.id = `listings_groups`.listing_id WHERE (`listings`.`id` = 5) AND ((`listings_groups`.group_id = 1)) LIMIT 1
SELECT * FROM `page_views` WHERE (controller = 'listing' and action = 'index') LIMIT 1
SELECT * FROM `reviews` WHERE (listing_id = 5 and user_id = 1) LIMIT 1
---
	def index
		# for redirection after login/logout
		session[:controller] = "listing"
		session[:action] = "index"
		session[:id] = params[:id]


		@listing = Listing.find_by_id(params[:id])
		@city = City.find_by_id(@listing.city_id)
		@groups = @listing.groups

		@options = "<option value='-1' checked>Choose a group</option>"
		for group in Group.find(:all) do
			if !group.listings.include?(@listing)
			@options = @options + "<option value=#{group.id}>#{group.hook}</option>"
			end
		end


		#review
		@curr_review = nil
		@other_reviews = nil
		if session[:user_id] != nil
			@other_reviews = Review.find(:all, :conditions => ['listing_id = ? and user_id != ?', @listing.id, session[:user_id]])

UPDATE `listings` SET `address` = '198 Rue de Rivoli, 75001 Paris, France', `updated_at` = '2010-08-26 16:05:34' WHERE `id` = 5
---

		@address = @listing.geocode_address
		if @listing.address == nil or @listing.address == ""
			@listing.update_attribute(:address, @address)

INSERT INTO `page_views` (`updated_at`, `page_view`, `action`, `controller`, `created_at`) VALUES('2010-08-29 20:57:01', 1, 'index', 'listing', '2010-08-29 20:57:01')
UPDATE `page_views` SET `page_view` = 2, `updated_at` = '2010-08-29 20:57:32' WHERE `id` = 1
---
		#calculate page view
		@pageView = PageView.find(:first, :conditions => ['controller = ? and action = ?', "listing","index"])
		if @pageView == nil
			@pageView = PageView.create(:controller => "listing", :action => "index", :page_view => "1")
		else
			pv = @pageView.page_view + 1
			@pageView.update_attribute(:page_view,pv)

SELECT * FROM `groups` WHERE (`groups`.`id` = '1') LIMIT 1
SELECT * FROM `listings` WHERE (`listings`.`id` = '5') LIMIT 1
SELECT `groups`.* FROM `groups` INNER JOIN `listings_groups` ON `groups`.id = `listings_groups`.group_id WHERE ((`listings_groups`.listing_id = 5))
SELECT `listings`.id FROM `listings` INNER JOIN `listings_groups` ON `listings`.id = `listings_groups`.listing_id WHERE (`listings`.`id` = 5) AND ((`listings_groups`.group_id = 1)) LIMIT 1
---
	def addGroup
		if request.post?
			group = Group.find_by_id(params[:group_list])
			@listing = Listing.find_by_id(params[:id])
			@listing.groups << group
			@listing.save

			@groups = @listing.groups

			@options = "<option value='-1' checked>Choose a group</option>"
			for group in Group.find(:all) do
				if !group.listings.include?(@listing)

SELECT * FROM `reviews` WHERE (user_id = 1 and listing_id = NULL) LIMIT 1
---
	def addReview
		review = Review.find(:first, :conditions => ['user_id = ? and listing_id = ?', session[:user_id], params[:id]])

SELECT * FROM `reviews` WHERE (user_id = 1 and listing_id = '5') LIMIT 1
UPDATE `reviews` SET `text` = 'testing again', `updated_at` = '2010-08-29 05:48:34' WHERE `id` = 1
INSERT INTO `reviews` (`updated_at`, `text`, `listing_id`, `user_id`, `created_at`) VALUES('2010-08-29 05:45:23', 'testing', 5, 1, '2010-08-29 05:45:23')
---
	def addReviewSubmit
		if request.post?
			r_hash = Hash.new
			r_hash['user_id'] = session[:user_id]
			r_hash['listing_id'] = params[:id]
			r_hash['text'] = params['review_content']
			review = Review.find(:first, :conditions => ['user_id = ? and listing_id = ?', r_hash['user_id'], r_hash['listing_id']])
			if params['review_content'].strip != ""
				if review != nil
					review.update_attributes(r_hash)
				else
					review = Review.create(r_hash)

SELECT * FROM `listings` WHERE (`listings`.`id` = '5') LIMIT 1
---
	def addTag
		@listing = Listing.find_by_id(params[:id])

SELECT * FROM `listings` WHERE (`listings`.`id` = 5)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT sum(`rates`.stars) AS sum_stars FROM `rates` WHERE (`rates`.rateable_id = 5 AND `rates`.rateable_type = 'Listing' AND (`rates`.`dimension` IS NULL))
---
	def rate
		@listing = Listing.find(params[:id])
		@listing.rate(params[:stars], User.find_by_id(session[:user_id]),params[:dimension])