app/controllers/travel_controller.rb

	def city
		session[:controller] = "travel"
		session[:action] = "city"
		@city = City.find_by_id(params[:id])
---
SELECT * FROM `cities` WHERE (`cities`.`id` = '1') LIMIT 1

	def getCities
		cities = City.find(:all, :conditions => ['country_id = ?', params[:country_id]])
---
SELECT * FROM `cities` WHERE (country_id = '1')