app/controllers/user_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'emma.nguyen') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`email` = 'nazia201@yahoo.com') LIMIT 1
---
	def register
		if request.post?

			if params[:user][:username] == ""
				flash[:username] = "Please specify your username."
			end

			if params[:user][:password] == ""
				flash[:password] = "Please specify your password."
			end

			if params[:user][:email] == ""
				flash[:email] = "Please specify your email."
			end
			if flash[:username] == nil and flash[:email] == nil and flash[:password] == nil
				@user = User.new(params[:user])
				@tmp = User.find_by_username(@user.username)
				if @tmp != nil
					flash[:username] = "Username already taken."
				else
					flash[:username] = nil
				end
				@tmp = User.find_by_email(@user.email)

INSERT INTO `users` (`updated_at`, `hashed_password`, `temp_pass_active`, `username`, `activation_code`, `email`, `temp_pass`, `active`, `created_at`) VALUES('2010-08-27 13:07:15', 'd914e3ecf6cc481114a3f534a5faf90b', NULL, 'andrew', '115sh0dferzmwb27stk0aaefj47pom3d', 'carnation@yahoo.com', NULL, NULL, '2010-08-27 13:07:15')
---

				if flash[:username] == nil and flash[:email] == nil and flash[:password] == nil
					@user.activation_code = UserController.random_string(32)
					@user.save